#include <stdio.h> // ไลบารี่

int main() {

    // บรรทัดที่ 1: a= 0.617%
    // - แสดง 'a= '
    // - ตัวเลข 0.617 (float) ที่มีทศนิยม 3 ตำแหน่ง
    // - แสดง '%'
    printf("a=%.3f%%\n", 0.617f); // .3f คือ 3 ตำแหน่งทศนิยม, %% คือเครื่องหมาย %

    // บรรทัดที่ 2: b=  25%
    // - แสดง 'b= '
    // - ตัวเลข 25 (float) ที่ไม่มีทศนิยม
    // - แสดง '%'
    printf("b=  %d%%\n", 25); // %d สำหรับ float ที่ไม่มีทศนิยม, %% คือเครื่องหมาย %

    // บรรทัดที่ 3: c =19.000%
    // - แสดง 'c ='
    // - ตัวเลข 19.000 (float) ที่มีทศนิยม 3 ตำแหน่ง
    // - แสดง '%'
    printf("c =%.3f%%\n", 19.000f);

    // บรรทัดที่ 4: d  =9 %
    // - แสดง 'd  ='
    // - ตัวเลข 9 (float) ที่ไม่มีทศนิยม
    // - เว้นวรรคและแสดง '%'
    printf("d  = %d %%\n", 9);

    // บรรทัดที่ 5: e=124.555 %
    // - แสดง 'e= '
    // - ตัวเลข 124.555 (float) ที่มีทศนิยม 3 ตำแหน่ง
    // - แสดง '%'
    printf("e=%.3f%%\n", 124.555f);

    // บรรทัดที่ 6: f=0.001%
    // - แสดง 'f='
    // - ตัวเลข 0.001 (float) ที่มีทศนิยม 3 ตำแหน่ง
    // - แสดง '%'
    printf("f=%.3f %%\n", 0.001f);

    return 0; // โปรแกรมทำงานสำเร็จ
}